export const pokeTypes = {
  アイアント: {
    type: ["むし", "はがね"],
  },
  アオガラス: {
    type: ["ひこう"],
  },
  アギルダー: {
    type: ["むし"],
  },
  アクジキング: {
    type: ["あく", "ドラゴン"],
  },
  アグノム: {
    type: ["エスパー"],
  },
  アゲハント: {
    type: ["むし", "ひこう"],
  },
  アゴジムシ: {
    type: ["むし"],
  },
  アサナン: {
    type: ["かくとう", "エスパー"],
  },
  アシマリ: {
    type: ["みず"],
  },
  アシレーヌ: {
    type: ["みず", "フェアリー"],
  },
  アズマオウ: {
    type: ["みず"],
  },
  アチゲータ: {
    type: ["ほのお"],
  },
  アチャモ: {
    type: ["ほのお"],
  },
  アップリュー: {
    type: ["くさ", "ドラゴン"],
  },
  アノクサ: {
    type: ["くさ", "ゴースト"],
  },
  アノプス: {
    type: ["いわ", "むし"],
  },
  アノホラグサ: {
    type: ["くさ", "ゴースト"],
  },
  アバゴーラ: {
    type: ["みず", "いわ"],
  },
  アブソル: {
    type: ["あく"],
  },
  アブリボン: {
    type: ["むし", "フェアリー"],
  },
  アブリー: {
    type: ["むし", "フェアリー"],
  },
  アマカジ: {
    type: ["くさ"],
  },
  アママイコ: {
    type: ["くさ"],
  },
  アマルス: {
    type: ["いわ", "こおり"],
  },
  アマルルガ: {
    type: ["いわ", "こおり"],
  },
  アマージョ: {
    type: ["くさ"],
  },
  アメタマ: {
    type: ["むし", "みず"],
  },
  アメモース: {
    type: ["むし", "ひこう"],
  },
  アヤシシ: {
    type: ["ノーマル", "エスパー"],
  },
  アラブルタケ: {
    type: ["くさ", "あく"],
  },
  アリアドス: {
    type: ["むし", "どく"],
  },
  アリゲイツ: {
    type: ["みず"],
  },
  アルクジラ: {
    type: ["こおり"],
  },
  アルセウス: {
    type: ["ノーマル"],
  },
  アンノーン: {
    type: ["エスパー"],
  },
  アーケオス: {
    type: ["いわ", "ひこう"],
  },
  アーケン: {
    type: ["いわ", "ひこう"],
  },
  アーゴヨン: {
    type: ["どく", "ドラゴン"],
  },
  アーボ: {
    type: ["どく"],
  },
  アーボック: {
    type: ["どく"],
  },
  アーマルド: {
    type: ["いわ", "むし"],
  },
  アーマーガア: {
    type: ["ひこう", "はがね"],
  },
  イエッサン: {
    type: ["エスパー", "ノーマル"],
  },
  イオルブ: {
    type: ["むし", "エスパー"],
  },
  イキリンコ: {
    type: ["ノーマル", "ひこう"],
  },
  イシズマイ: {
    type: ["むし", "いわ"],
  },
  "イシツブテ(アローラ)": {
    type: ["いわ", "でんき"],
  },
  イシツブテ: {
    type: ["いわ", "じめん"],
  },
  イシヘンジン: {
    type: ["いわ"],
  },
  イダイトウ: {
    type: ["みず", "ゴースト"],
  },
  イダイナキバ: {
    type: ["じめん", "かくとう"],
  },
  イッカネズミ: {
    type: ["ノーマル"],
  },
  イトマル: {
    type: ["むし", "どく"],
  },
  イノムー: {
    type: ["こおり", "じめん"],
  },
  イベルタル: {
    type: ["あく", "ひこう"],
  },
  イルカマン: {
    type: ["みず"],
  },
  イルミーゼ: {
    type: ["むし"],
  },
  イワパレス: {
    type: ["むし", "いわ"],
  },
  イワンコ: {
    type: ["いわ"],
  },
  イワーク: {
    type: ["いわ", "じめん"],
  },
  インテレオン: {
    type: ["みず"],
  },
  イーブイ: {
    type: ["ノーマル"],
  },
  イーユイ: {
    type: ["あく", "ほのお"],
  },
  "ウインディ(ヒスイ)": {
    type: ["ほのお", "いわ"],
  },
  ウインディ: {
    type: ["ほのお"],
  },
  ウェルカモ: {
    type: ["みず"],
  },
  ウェーニバル: {
    type: ["みず", "かくとう"],
  },
  "ウォーグル(ヒスイ)": {
    type: ["エスパー", "ひこう"],
  },
  ウォーグル: {
    type: ["ノーマル", "ひこう"],
  },
  ウオチルドン: {
    type: ["みず", "こおり"],
  },
  ウオノラゴン: {
    type: ["みず", "ドラゴン"],
  },
  ウソッキー: {
    type: ["いわ"],
  },
  ウソハチ: {
    type: ["いわ"],
  },
  ウッウ: {
    type: ["ひこう", "みず"],
  },
  ウツドン: {
    type: ["くさ", "どく"],
  },
  ウツボット: {
    type: ["くさ", "どく"],
  },
  ウツロイド: {
    type: ["いわ", "どく"],
  },
  ウデッポウ: {
    type: ["みず"],
  },
  "ウパー(パルデア)": {
    type: ["どく", "じめん"],
  },
  ウパー: {
    type: ["みず", "じめん"],
  },
  ウミディグダ: {
    type: ["みず"],
  },
  ウミトリオ: {
    type: ["みず"],
  },
  ウリムー: {
    type: ["こおり", "じめん"],
  },
  ウルガモス: {
    type: ["むし", "ほのお"],
  },
  "ウーラオス(いちげき)": {
    type: ["かくとう", "あく"],
  },
  "ウーラオス(れんげき)": {
    type: ["かくとう", "みず"],
  },
  ウールー: {
    type: ["ノーマル"],
  },
  エアームド: {
    type: ["はがね", "ひこう"],
  },
  エイパム: {
    type: ["ノーマル"],
  },
  エクスレッグ: {
    type: ["むし", "あく"],
  },
  エテボース: {
    type: ["ノーマル"],
  },
  エネコ: {
    type: ["ノーマル"],
  },
  エネコロロ: {
    type: ["ノーマル"],
  },
  エビワラー: {
    type: ["かくとう"],
  },
  エムリット: {
    type: ["エスパー"],
  },
  エモンガ: {
    type: ["でんき", "ひこう"],
  },
  エリキテル: {
    type: ["でんき", "ノーマル"],
  },
  エルフーン: {
    type: ["くさ", "フェアリー"],
  },
  エルレイド: {
    type: ["エスパー", "かくとう"],
  },
  エレキッド: {
    type: ["でんき"],
  },
  エレキブル: {
    type: ["でんき"],
  },
  エレザード: {
    type: ["でんき", "ノーマル"],
  },
  エレズン: {
    type: ["でんき", "どく"],
  },
  エレブー: {
    type: ["でんき"],
  },
  エンテイ: {
    type: ["ほのお"],
  },
  エンニュート: {
    type: ["どく", "ほのお"],
  },
  エンブオー: {
    type: ["ほのお", "かくとう"],
  },
  エンペルト: {
    type: ["みず", "はがね"],
  },
  エースバーン: {
    type: ["ほのお"],
  },
  エーフィ: {
    type: ["エスパー"],
  },
  オオスバメ: {
    type: ["ノーマル", "ひこう"],
  },
  オオタチ: {
    type: ["ノーマル"],
  },
  オオニューラ: {
    type: ["かくとう", "どく"],
  },
  オクタン: {
    type: ["みず"],
  },
  オコリザル: {
    type: ["かくとう"],
  },
  オシャマリ: {
    type: ["みず"],
  },
  オタチ: {
    type: ["ノーマル"],
  },
  オタマロ: {
    type: ["みず"],
  },
  オトシドリ: {
    type: ["ひこう", "あく"],
  },
  オトスパス: {
    type: ["かくとう"],
  },
  オドシシ: {
    type: ["ノーマル"],
  },
  "オドリドリ(ぱちぱち)": {
    type: ["でんき", "ひこう"],
  },
  "オドリドリ(ふらふら)": {
    type: ["エスパー", "ひこう"],
  },
  "オドリドリ(まいまい)": {
    type: ["ゴースト", "ひこう"],
  },
  "オドリドリ(めらめら)": {
    type: ["ほのお", "ひこう"],
  },
  オニゴーリ: {
    type: ["こおり"],
  },
  オニシズクモ: {
    type: ["みず", "むし"],
  },
  オニスズメ: {
    type: ["ノーマル", "ひこう"],
  },
  オニドリル: {
    type: ["ノーマル", "ひこう"],
  },
  オノノクス: {
    type: ["ドラゴン"],
  },
  オノンド: {
    type: ["ドラゴン"],
  },
  オムスター: {
    type: ["いわ", "みず"],
  },
  オムナイト: {
    type: ["いわ", "みず"],
  },
  オラチフ: {
    type: ["あく"],
  },
  オリーニョ: {
    type: ["くさ", "ノーマル"],
  },
  オリーヴァ: {
    type: ["くさ", "ノーマル"],
  },
  オンバット: {
    type: ["ひこう", "ドラゴン"],
  },
  オンバーン: {
    type: ["ひこう", "ドラゴン"],
  },
  オーダイル: {
    type: ["みず"],
  },
  オーベム: {
    type: ["エスパー"],
  },
  オーロット: {
    type: ["ゴースト", "くさ"],
  },
  オーロンゲ: {
    type: ["あく", "フェアリー"],
  },
  カイオーガ: {
    type: ["みず"],
  },
  カイデン: {
    type: ["でんき", "ひこう"],
  },
  カイリキー: {
    type: ["かくとう"],
  },
  カイリュー: {
    type: ["ドラゴン", "ひこう"],
  },
  カイロス: {
    type: ["むし"],
  },
  カエンジシ: {
    type: ["ほのお", "ノーマル"],
  },
  カクレオン: {
    type: ["ノーマル"],
  },
  カゲボウズ: {
    type: ["ゴースト"],
  },
  カジッチュ: {
    type: ["くさ", "ドラゴン"],
  },
  カジリガメ: {
    type: ["みず", "いわ"],
  },
  カチコール: {
    type: ["こおり"],
  },
  カヌチャン: {
    type: ["フェアリー", "はがね"],
  },
  カバルドン: {
    type: ["じめん"],
  },
  カビゴン: {
    type: ["ノーマル"],
  },
  カブト: {
    type: ["いわ", "みず"],
  },
  カブトプス: {
    type: ["いわ", "みず"],
  },
  カブルモ: {
    type: ["むし"],
  },
  カプサイジ: {
    type: ["くさ"],
  },
  "カプ・コケコ": {
    type: ["でんき", "フェアリー"],
  },
  "カプ・テテフ": {
    type: ["エスパー", "フェアリー"],
  },
  "カプ・ブルル": {
    type: ["くさ", "フェアリー"],
  },
  "カプ・レヒレ": {
    type: ["みず", "フェアリー"],
  },
  カポエラー: {
    type: ["かくとう"],
  },
  カマスジョー: {
    type: ["みず"],
  },
  カミツルギ: {
    type: ["くさ", "はがね"],
  },
  カムカメ: {
    type: ["みず"],
  },
  カメックス: {
    type: ["みず"],
  },
  カメテテ: {
    type: ["いわ", "みず"],
  },
  カメール: {
    type: ["みず"],
  },
  "カモネギ(ガラル)": {
    type: ["かくとう"],
  },
  カモネギ: {
    type: ["ノーマル", "ひこう"],
  },
  カラカラ: {
    type: ["じめん"],
  },
  カラサリス: {
    type: ["むし"],
  },
  カラナクシ: {
    type: ["みず"],
  },
  カラマネロ: {
    type: ["あく", "エスパー"],
  },
  カラミンゴ: {
    type: ["ひこう", "かくとう"],
  },
  カリキリ: {
    type: ["くさ"],
  },
  カルボウ: {
    type: ["ほのお"],
  },
  ガオガエン: {
    type: ["ほのお", "あく"],
  },
  ガケガニ: {
    type: ["いわ"],
  },
  ガチグマ: {
    type: ["じめん", "ノーマル"],
  },
  ガチゴラス: {
    type: ["いわ", "ドラゴン"],
  },
  ガバイト: {
    type: ["ドラゴン", "じめん"],
  },
  ガブリアス: {
    type: ["ドラゴン", "じめん"],
  },
  ガマガル: {
    type: ["みず", "じめん"],
  },
  ガマゲロゲ: {
    type: ["みず", "じめん"],
  },
  ガメノデス: {
    type: ["いわ", "みず"],
  },
  "ガラガラ(アローラ)": {
    type: ["ほのお", "ゴースト"],
  },
  ガラガラ: {
    type: ["じめん"],
  },
  ガルーラ: {
    type: ["ノーマル"],
  },
  ガントル: {
    type: ["いわ"],
  },
  "ガーディ(ヒスイ)": {
    type: ["ほのお", "いわ"],
  },
  ガーディ: {
    type: ["ほのお"],
  },
  ガーメイル: {
    type: ["むし", "ひこう"],
  },
  キテルグマ: {
    type: ["ノーマル", "かくとう"],
  },
  キノガッサ: {
    type: ["くさ", "かくとう"],
  },
  キノココ: {
    type: ["くさ"],
  },
  キバゴ: {
    type: ["ドラゴン"],
  },
  キバニア: {
    type: ["みず", "あく"],
  },
  キマワリ: {
    type: ["くさ"],
  },
  キモリ: {
    type: ["くさ"],
  },
  キャタピー: {
    type: ["むし"],
  },
  キャモメ: {
    type: ["みず", "ひこう"],
  },
  "キュウコン(アローラ)": {
    type: ["こおり", "フェアリー"],
  },
  キュウコン: {
    type: ["ほのお"],
  },
  キュレム: {
    type: ["ドラゴン", "こおり"],
  },
  キュワワー: {
    type: ["フェアリー"],
  },
  キョジオーン: {
    type: ["いわ"],
  },
  キラフロル: {
    type: ["いわ", "どく"],
  },
  キラーメ: {
    type: ["いわ", "どく"],
  },
  キリキザン: {
    type: ["あく", "はがね"],
  },
  キリンリキ: {
    type: ["ノーマル", "エスパー"],
  },
  キルリア: {
    type: ["エスパー", "フェアリー"],
  },
  キレイハナ: {
    type: ["くさ"],
  },
  キングドラ: {
    type: ["みず", "ドラゴン"],
  },
  キングラー: {
    type: ["みず"],
  },
  ギアル: {
    type: ["はがね"],
  },
  ギガイアス: {
    type: ["いわ"],
  },
  ギギアル: {
    type: ["はがね"],
  },
  ギギギアル: {
    type: ["はがね"],
  },
  ギモー: {
    type: ["あく", "フェアリー"],
  },
  ギャラドス: {
    type: ["みず", "ひこう"],
  },
  "ギャロップ(ガラル)": {
    type: ["エスパー", "フェアリー"],
  },
  ギャロップ: {
    type: ["ほのお"],
  },
  ギラティナ: {
    type: ["ゴースト", "ドラゴン"],
  },
  ギルガルド: {
    type: ["はがね", "ゴースト"],
  },
  クイタラン: {
    type: ["ほのお"],
  },
  クエスパトラ: {
    type: ["エスパー"],
  },
  クサイハナ: {
    type: ["くさ", "どく"],
  },
  クスネ: {
    type: ["あく"],
  },
  クズモー: {
    type: ["どく", "みず"],
  },
  クチート: {
    type: ["はがね", "フェアリー"],
  },
  クヌギダマ: {
    type: ["むし"],
  },
  クマシュン: {
    type: ["こおり"],
  },
  クラブ: {
    type: ["みず"],
  },
  クリムガン: {
    type: ["ドラゴン"],
  },
  クルマユ: {
    type: ["むし", "くさ"],
  },
  クルミル: {
    type: ["むし", "くさ"],
  },
  クレセリア: {
    type: ["エスパー"],
  },
  クレッフィ: {
    type: ["はがね", "フェアリー"],
  },
  "クレベース(ヒスイ)": {
    type: ["こおり", "いわ"],
  },
  クレベース: {
    type: ["こおり"],
  },
  クロバット: {
    type: ["どく", "ひこう"],
  },
  クワガノン: {
    type: ["むし", "でんき"],
  },
  クワッス: {
    type: ["みず"],
  },
  グソクムシャ: {
    type: ["むし", "みず"],
  },
  グライオン: {
    type: ["じめん", "ひこう"],
  },
  グライガー: {
    type: ["じめん", "ひこう"],
  },
  グラエナ: {
    type: ["あく"],
  },
  グランブル: {
    type: ["フェアリー"],
  },
  グラードン: {
    type: ["じめん"],
  },
  グルトン: {
    type: ["ノーマル"],
  },
  グレイシア: {
    type: ["こおり"],
  },
  グレッグル: {
    type: ["どく", "かくとう"],
  },
  グレンアルマ: {
    type: ["ほのお", "エスパー"],
  },
  ケイコウオ: {
    type: ["みず"],
  },
  ケケンカニ: {
    type: ["かくとう", "こおり"],
  },
  ケッキング: {
    type: ["ノーマル"],
  },
  ケムッソ: {
    type: ["むし"],
  },
  ケララッパ: {
    type: ["ノーマル", "ひこう"],
  },
  ケルディオ: {
    type: ["みず", "かくとう"],
  },
  ケロマツ: {
    type: ["みず"],
  },
  "ケンタロス(パルデア)": {
    type: ["かくとう", "みず"],
  },
  ケンタロス: {
    type: ["ノーマル"],
  },
  ケンホロウ: {
    type: ["ノーマル", "ひこう"],
  },
  ケーシィ: {
    type: ["エスパー"],
  },
  ゲコガシラ: {
    type: ["みず"],
  },
  ゲッコウガ: {
    type: ["みず", "あく"],
  },
  ゲノセクト: {
    type: ["むし", "はがね"],
  },
  ゲンガー: {
    type: ["ゴースト", "どく"],
  },
  コアルヒー: {
    type: ["みず", "ひこう"],
  },
  コイキング: {
    type: ["みず"],
  },
  コイル: {
    type: ["でんき", "はがね"],
  },
  コオリッポ: {
    type: ["こおり"],
  },
  コクーン: {
    type: ["むし", "どく"],
  },
  ココガラ: {
    type: ["ひこう"],
  },
  ココドラ: {
    type: ["はがね", "いわ"],
  },
  ココロモリ: {
    type: ["エスパー", "ひこう"],
  },
  コジオ: {
    type: ["いわ"],
  },
  コジョフー: {
    type: ["かくとう"],
  },
  コジョンド: {
    type: ["かくとう"],
  },
  コスモウム: {
    type: ["エスパー"],
  },
  コスモッグ: {
    type: ["エスパー"],
  },
  コソクムシ: {
    type: ["むし", "みず"],
  },
  コダック: {
    type: ["みず"],
  },
  コドラ: {
    type: ["はがね", "いわ"],
  },
  コノハナ: {
    type: ["くさ", "あく"],
  },
  コノヨザル: {
    type: ["かくとう", "ゴースト"],
  },
  コバルオン: {
    type: ["はがね", "かくとう"],
  },
  コフキムシ: {
    type: ["むし"],
  },
  コフーライ: {
    type: ["むし"],
  },
  コマタナ: {
    type: ["あく", "はがね"],
  },
  コモルー: {
    type: ["ドラゴン"],
  },
  コライドン: {
    type: ["かくとう", "ドラゴン"],
  },
  "コラッタ(アローラ)": {
    type: ["あく", "ノーマル"],
  },
  コラッタ: {
    type: ["ノーマル"],
  },
  コリンク: {
    type: ["でんき"],
  },
  コレクレー: {
    type: ["ゴースト"],
  },
  コロトック: {
    type: ["むし"],
  },
  コロボーシ: {
    type: ["むし"],
  },
  コロモリ: {
    type: ["エスパー", "ひこう"],
  },
  コンパン: {
    type: ["むし", "どく"],
  },
  コータス: {
    type: ["ほのお"],
  },
  ゴウカザル: {
    type: ["ほのお", "かくとう"],
  },
  ゴクリン: {
    type: ["どく"],
  },
  ゴチミル: {
    type: ["エスパー"],
  },
  ゴチム: {
    type: ["エスパー"],
  },
  ゴチルゼル: {
    type: ["エスパー"],
  },
  ゴニョニョ: {
    type: ["ノーマル"],
  },
  ゴビット: {
    type: ["じめん", "ゴースト"],
  },
  ゴマゾウ: {
    type: ["じめん"],
  },
  ゴリランダー: {
    type: ["くさ"],
  },
  ゴルダック: {
    type: ["みず"],
  },
  ゴルバット: {
    type: ["どく", "ひこう"],
  },
  ゴルーグ: {
    type: ["じめん", "ゴースト"],
  },
  ゴロンダ: {
    type: ["かくとう", "あく"],
  },
  "ゴローニャ(アローラ)": {
    type: ["いわ", "でんき"],
  },
  ゴローニャ: {
    type: ["いわ", "じめん"],
  },
  "ゴローン(アローラ)": {
    type: ["いわ", "でんき"],
  },
  ゴローン: {
    type: ["いわ", "じめん"],
  },
  ゴンベ: {
    type: ["ノーマル"],
  },
  ゴーゴート: {
    type: ["くさ"],
  },
  ゴース: {
    type: ["ゴースト", "どく"],
  },
  ゴースト: {
    type: ["ゴースト", "どく"],
  },
  ゴーリキー: {
    type: ["かくとう"],
  },
  サイドン: {
    type: ["じめん", "いわ"],
  },
  サイホーン: {
    type: ["じめん", "いわ"],
  },
  サクラビス: {
    type: ["みず"],
  },
  サケブシッポ: {
    type: ["フェアリー", "エスパー"],
  },
  サザンドラ: {
    type: ["あく", "ドラゴン"],
  },
  サシカマス: {
    type: ["みず"],
  },
  サダイジャ: {
    type: ["じめん"],
  },
  サッチムシ: {
    type: ["むし"],
  },
  サナギラス: {
    type: ["いわ", "じめん"],
  },
  サニゴーン: {
    type: ["ゴースト"],
  },
  "サニーゴ(ガラル)": {
    type: ["ゴースト"],
  },
  サニーゴ: {
    type: ["みず", "いわ"],
  },
  サボネア: {
    type: ["くさ"],
  },
  サマヨール: {
    type: ["ゴースト"],
  },
  サメハダー: {
    type: ["みず", "あく"],
  },
  サルノリ: {
    type: ["くさ"],
  },
  サワムラー: {
    type: ["かくとう"],
  },
  "サンダー(ガラル)": {
    type: ["かくとう", "ひこう"],
  },
  サンダー: {
    type: ["でんき", "ひこう"],
  },
  サンダース: {
    type: ["でんき"],
  },
  "サンド(アローラ)": {
    type: ["こおり", "はがね"],
  },
  サンド: {
    type: ["じめん"],
  },
  "サンドパン(アローラ)": {
    type: ["こおり", "はがね"],
  },
  サンドパン: {
    type: ["じめん"],
  },
  サーナイト: {
    type: ["エスパー", "フェアリー"],
  },
  サーフゴー: {
    type: ["はがね", "ゴースト"],
  },
  "ザシアン(れきせんのゆうしゃ)": {
    type: ["フェアリー"],
  },
  "ザマゼンタ(れきせんのゆうしゃ)": {
    type: ["かくとう"],
  },
  ザルード: {
    type: ["あく", "くさ"],
  },
  ザングース: {
    type: ["ノーマル"],
  },
  "シェイミ(スカイ)": {
    type: ["くさ", "ひこう"],
  },
  シェイミ: {
    type: ["くさ"],
  },
  シェルダー: {
    type: ["みず"],
  },
  シガロコ: {
    type: ["むし"],
  },
  シキジカ: {
    type: ["ノーマル", "くさ"],
  },
  シザリガー: {
    type: ["みず", "あく"],
  },
  シシコ: {
    type: ["ほのお", "ノーマル"],
  },
  シズクモ: {
    type: ["みず", "むし"],
  },
  シビシラス: {
    type: ["でんき"],
  },
  シビビール: {
    type: ["でんき"],
  },
  シビルドン: {
    type: ["でんき"],
  },
  シママ: {
    type: ["でんき"],
  },
  シャリタツ: {
    type: ["ドラゴン", "みず"],
  },
  シャワーズ: {
    type: ["みず"],
  },
  シャンデラ: {
    type: ["ゴースト", "ほのお"],
  },
  シュシュプ: {
    type: ["フェアリー"],
  },
  シュバルゴ: {
    type: ["むし", "はがね"],
  },
  シルシュルー: {
    type: ["どく", "ノーマル"],
  },
  シルヴァディ: {
    type: ["ノーマル"],
  },
  シロデスナ: {
    type: ["ゴースト", "じめん"],
  },
  シンボラー: {
    type: ["エスパー", "ひこう"],
  },
  シードラ: {
    type: ["みず"],
  },
  ジオヅム: {
    type: ["いわ"],
  },
  ジガルデ: {
    type: ["ドラゴン", "じめん"],
  },
  "ジグザグマ(ガラル)": {
    type: ["あく", "ノーマル"],
  },
  ジグザグマ: {
    type: ["ノーマル"],
  },
  ジジーロン: {
    type: ["ノーマル", "ドラゴン"],
  },
  ジバコイル: {
    type: ["でんき", "はがね"],
  },
  ジヘッド: {
    type: ["あく", "ドラゴン"],
  },
  ジメレオン: {
    type: ["みず"],
  },
  ジャノビー: {
    type: ["くさ"],
  },
  ジャラコ: {
    type: ["ドラゴン"],
  },
  ジャラランガ: {
    type: ["ドラゴン", "かくとう"],
  },
  ジャランゴ: {
    type: ["ドラゴン", "かくとう"],
  },
  ジャローダ: {
    type: ["くさ"],
  },
  ジュカイン: {
    type: ["くさ"],
  },
  ジュゴン: {
    type: ["みず", "こおり"],
  },
  "ジュナイパー(ヒスイ)": {
    type: ["くさ", "かくとう"],
  },
  ジュナイパー: {
    type: ["くさ", "ゴースト"],
  },
  ジュプトル: {
    type: ["くさ"],
  },
  ジュペッタ: {
    type: ["ゴースト"],
  },
  ジュラルドン: {
    type: ["はがね", "ドラゴン"],
  },
  ジラーチ: {
    type: ["はがね", "エスパー"],
  },
  ジーランス: {
    type: ["みず", "いわ"],
  },
  スイクン: {
    type: ["みず"],
  },
  スカタンク: {
    type: ["どく", "あく"],
  },
  スカンプー: {
    type: ["どく", "あく"],
  },
  スコルピ: {
    type: ["どく", "むし"],
  },
  スコヴィラン: {
    type: ["くさ", "ほのお"],
  },
  スターミー: {
    type: ["みず", "エスパー"],
  },
  ストライク: {
    type: ["むし", "ひこう"],
  },
  ストリンダー: {
    type: ["でんき", "どく"],
  },
  スナノケガワ: {
    type: ["でんき", "じめん"],
  },
  スナバァ: {
    type: ["ゴースト", "じめん"],
  },
  スナヘビ: {
    type: ["じめん"],
  },
  スバメ: {
    type: ["ノーマル", "ひこう"],
  },
  スピアー: {
    type: ["むし", "どく"],
  },
  スボミー: {
    type: ["くさ", "どく"],
  },
  スリーパー: {
    type: ["エスパー"],
  },
  スリープ: {
    type: ["エスパー"],
  },
  スワンナ: {
    type: ["みず", "ひこう"],
  },
  ズガイドス: {
    type: ["いわ"],
  },
  ズガドーン: {
    type: ["ほのお", "ゴースト"],
  },
  ズバット: {
    type: ["どく", "ひこう"],
  },
  ズピカ: {
    type: ["でんき"],
  },
  ズルズキン: {
    type: ["あく", "かくとう"],
  },
  ズルッグ: {
    type: ["あく", "かくとう"],
  },
  セキタンザン: {
    type: ["いわ", "ほのお"],
  },
  セグレイブ: {
    type: ["ドラゴン", "こおり"],
  },
  セゴール: {
    type: ["ドラゴン", "こおり"],
  },
  セビエ: {
    type: ["ドラゴン", "こおり"],
  },
  セレビィ: {
    type: ["エスパー", "くさ"],
  },
  ゼクロム: {
    type: ["ドラゴン", "でんき"],
  },
  ゼニガメ: {
    type: ["みず"],
  },
  ゼブライカ: {
    type: ["でんき"],
  },
  ゼラオラ: {
    type: ["でんき"],
  },
  ゼルネアス: {
    type: ["フェアリー"],
  },
  ソウブレイズ: {
    type: ["ほのお", "ゴースト"],
  },
  ソルガレオ: {
    type: ["エスパー", "はがね"],
  },
  ソルロック: {
    type: ["いわ", "エスパー"],
  },
  ソーナノ: {
    type: ["エスパー"],
  },
  ソーナンス: {
    type: ["エスパー"],
  },
  ゾウドウ: {
    type: ["はがね"],
  },
  "ゾロア(ヒスイ)": {
    type: ["ノーマル", "ゴースト"],
  },
  ゾロア: {
    type: ["あく"],
  },
  "ゾロアーク(ヒスイ)": {
    type: ["ノーマル", "ゴースト"],
  },
  ゾロアーク: {
    type: ["あく"],
  },
  タイカイデン: {
    type: ["でんき", "ひこう"],
  },
  "タイプ:ヌル": {
    type: ["ノーマル"],
  },
  タイレーツ: {
    type: ["かくとう"],
  },
  タギングル: {
    type: ["どく", "ノーマル"],
  },
  タタッコ: {
    type: ["かくとう"],
  },
  タチフサグマ: {
    type: ["あく", "ノーマル"],
  },
  タッツー: {
    type: ["みず"],
  },
  タツベイ: {
    type: ["ドラゴン"],
  },
  タテトプス: {
    type: ["いわ", "はがね"],
  },
  タネボー: {
    type: ["くさ"],
  },
  タブンネ: {
    type: ["ノーマル"],
  },
  タマゲタケ: {
    type: ["くさ", "どく"],
  },
  タマザラシ: {
    type: ["こおり", "みず"],
  },
  タマタマ: {
    type: ["くさ", "エスパー"],
  },
  タマンタ: {
    type: ["みず", "ひこう"],
  },
  タマンチュラ: {
    type: ["むし"],
  },
  タルップル: {
    type: ["くさ", "ドラゴン"],
  },
  タンドン: {
    type: ["いわ"],
  },
  ダイオウドウ: {
    type: ["はがね"],
  },
  "ダイケンキ(ヒスイ)": {
    type: ["みず", "あく"],
  },
  ダイケンキ: {
    type: ["みず"],
  },
  ダイノーズ: {
    type: ["いわ", "はがね"],
  },
  ダクマ: {
    type: ["かくとう"],
  },
  "ダグトリオ(アローラ)": {
    type: ["じめん", "はがね"],
  },
  ダグトリオ: {
    type: ["じめん"],
  },
  ダゲキ: {
    type: ["かくとう"],
  },
  ダストダス: {
    type: ["どく"],
  },
  ダダリン: {
    type: ["ゴースト", "くさ"],
  },
  ダブラン: {
    type: ["エスパー"],
  },
  "ダルマッカ(ガラル)": {
    type: ["こおり"],
  },
  ダルマッカ: {
    type: ["ほのお"],
  },
  ダンゴロ: {
    type: ["いわ"],
  },
  ダンバル: {
    type: ["はがね", "エスパー"],
  },
  ダークライ: {
    type: ["あく"],
  },
  ダーテング: {
    type: ["くさ", "あく"],
  },
  チェリム: {
    type: ["くさ"],
  },
  チェリンボ: {
    type: ["くさ"],
  },
  チオンジェン: {
    type: ["あく", "くさ"],
  },
  チコリータ: {
    type: ["くさ"],
  },
  チゴラス: {
    type: ["いわ", "ドラゴン"],
  },
  チャオブー: {
    type: ["ほのお", "かくとう"],
  },
  チャーレム: {
    type: ["かくとう", "エスパー"],
  },
  チュリネ: {
    type: ["くさ"],
  },
  チョボマキ: {
    type: ["むし"],
  },
  チョロネコ: {
    type: ["あく"],
  },
  チョンチー: {
    type: ["みず", "でんき"],
  },
  チラチーノ: {
    type: ["ノーマル"],
  },
  チラーミィ: {
    type: ["ノーマル"],
  },
  チリーン: {
    type: ["エスパー"],
  },
  チルタリス: {
    type: ["ドラゴン", "ひこう"],
  },
  チルット: {
    type: ["ノーマル", "ひこう"],
  },
  チヲハウハネ: {
    type: ["むし", "かくとう"],
  },
  ツタージャ: {
    type: ["くさ"],
  },
  ツチニン: {
    type: ["むし", "じめん"],
  },
  ツツケラ: {
    type: ["ノーマル", "ひこう"],
  },
  ツボツボ: {
    type: ["むし", "いわ"],
  },
  ツンデツンデ: {
    type: ["いわ", "はがね"],
  },
  ツンベアー: {
    type: ["こおり"],
  },
  テッカグヤ: {
    type: ["はがね", "ひこう"],
  },
  テッカニン: {
    type: ["むし", "ひこう"],
  },
  テッシード: {
    type: ["くさ", "はがね"],
  },
  テッポウオ: {
    type: ["みず"],
  },
  テツノイバラ: {
    type: ["いわ", "でんき"],
  },
  テツノカイナ: {
    type: ["かくとう", "でんき"],
  },
  テツノコウベ: {
    type: ["あく", "ひこう"],
  },
  テツノツツミ: {
    type: ["こおり", "みず"],
  },
  テツノドクガ: {
    type: ["ほのお", "どく"],
  },
  テツノブジン: {
    type: ["フェアリー", "かくとう"],
  },
  テツノワダチ: {
    type: ["じめん", "はがね"],
  },
  テブリム: {
    type: ["エスパー"],
  },
  テラキオン: {
    type: ["いわ", "かくとう"],
  },
  テールナー: {
    type: ["ほのお"],
  },
  ディアルガ: {
    type: ["はがね", "ドラゴン"],
  },
  ディアンシー: {
    type: ["いわ", "フェアリー"],
  },
  "ディグダ(アローラ)": {
    type: ["じめん", "はがね"],
  },
  ディグダ: {
    type: ["じめん"],
  },
  ディンルー: {
    type: ["あく", "じめん"],
  },
  デオキシス: {
    type: ["エスパー"],
  },
  デカグース: {
    type: ["ノーマル"],
  },
  デカヌチャン: {
    type: ["フェアリー", "はがね"],
  },
  デスカーン: {
    type: ["ゴースト"],
  },
  デスバーン: {
    type: ["じめん", "ゴースト"],
  },
  "デスマス(ガラル)": {
    type: ["じめん", "ゴースト"],
  },
  デスマス: {
    type: ["ゴースト"],
  },
  デデンネ: {
    type: ["でんき", "フェアリー"],
  },
  デリバード: {
    type: ["こおり", "ひこう"],
  },
  デルビル: {
    type: ["あく", "ほのお"],
  },
  デンジュモク: {
    type: ["でんき"],
  },
  デンチュラ: {
    type: ["むし", "でんき"],
  },
  デンヂムシ: {
    type: ["むし", "でんき"],
  },
  デンリュウ: {
    type: ["でんき"],
  },
  トゲキッス: {
    type: ["フェアリー", "ひこう"],
  },
  トゲチック: {
    type: ["フェアリー", "ひこう"],
  },
  トゲデマル: {
    type: ["でんき", "はがね"],
  },
  トゲピー: {
    type: ["フェアリー"],
  },
  トサキント: {
    type: ["みず"],
  },
  トドグラー: {
    type: ["こおり", "みず"],
  },
  トドゼルガ: {
    type: ["こおり", "みず"],
  },
  トドロクツキ: {
    type: ["ドラゴン", "あく"],
  },
  トランセル: {
    type: ["むし"],
  },
  トリデプス: {
    type: ["いわ", "はがね"],
  },
  トリトドン: {
    type: ["みず", "じめん"],
  },
  トリミアン: {
    type: ["ノーマル"],
  },
  トルネロス: {
    type: ["ひこう"],
  },
  トロッゴン: {
    type: ["いわ", "ほのお"],
  },
  トロピウス: {
    type: ["くさ", "ひこう"],
  },
  ドオー: {
    type: ["どく", "じめん"],
  },
  ドガース: {
    type: ["どく"],
  },
  ドククラゲ: {
    type: ["みず", "どく"],
  },
  ドクケイル: {
    type: ["むし", "どく"],
  },
  ドクロッグ: {
    type: ["どく", "かくとう"],
  },
  ドゴーム: {
    type: ["ノーマル"],
  },
  ドサイドン: {
    type: ["じめん", "いわ"],
  },
  ドジョッチ: {
    type: ["みず", "じめん"],
  },
  ドダイトス: {
    type: ["くさ", "じめん"],
  },
  ドッコラー: {
    type: ["かくとう"],
  },
  ドテッコツ: {
    type: ["かくとう"],
  },
  ドデカバシ: {
    type: ["ノーマル", "ひこう"],
  },
  ドドゲザン: {
    type: ["あく", "はがね"],
  },
  ドヒドイデ: {
    type: ["どく", "みず"],
  },
  ドラパルト: {
    type: ["ドラゴン", "ゴースト"],
  },
  ドラピオン: {
    type: ["どく", "あく"],
  },
  ドラミドロ: {
    type: ["どく", "ドラゴン"],
  },
  ドラメシヤ: {
    type: ["ドラゴン", "ゴースト"],
  },
  ドリュウズ: {
    type: ["じめん", "はがね"],
  },
  "ドレディア(ヒスイ)": {
    type: ["くさ", "かくとう"],
  },
  ドレディア: {
    type: ["くさ"],
  },
  ドロバンコ: {
    type: ["じめん"],
  },
  ドロンチ: {
    type: ["ドラゴン", "ゴースト"],
  },
  ドンカラス: {
    type: ["あく", "ひこう"],
  },
  ドンファン: {
    type: ["じめん"],
  },
  ドンメル: {
    type: ["ほのお", "じめん"],
  },
  ドータクン: {
    type: ["はがね", "エスパー"],
  },
  ドードリオ: {
    type: ["ノーマル", "ひこう"],
  },
  ドードー: {
    type: ["ノーマル", "ひこう"],
  },
  ドーブル: {
    type: ["ノーマル"],
  },
  ドーミラー: {
    type: ["はがね", "エスパー"],
  },
  ナエトル: {
    type: ["くさ"],
  },
  ナカヌチャン: {
    type: ["フェアリー", "はがね"],
  },
  ナゲキ: {
    type: ["かくとう"],
  },
  ナゲツケサル: {
    type: ["かくとう"],
  },
  ナゾノクサ: {
    type: ["くさ", "どく"],
  },
  ナックラー: {
    type: ["じめん"],
  },
  "ナッシー(アローラ)": {
    type: ["くさ", "ドラゴン"],
  },
  ナッシー: {
    type: ["くさ", "エスパー"],
  },
  ナットレイ: {
    type: ["くさ", "はがね"],
  },
  ナマケロ: {
    type: ["ノーマル"],
  },
  ナマコブシ: {
    type: ["みず"],
  },
  ナマズン: {
    type: ["みず", "じめん"],
  },
  ナミイルカ: {
    type: ["みず"],
  },
  ニダンギル: {
    type: ["はがね", "ゴースト"],
  },
  ニドキング: {
    type: ["どく", "じめん"],
  },
  ニドクイン: {
    type: ["どく", "じめん"],
  },
  "ニドラン♀": {
    type: ["どく"],
  },
  "ニドラン♂": {
    type: ["どく"],
  },
  ニドリーナ: {
    type: ["どく"],
  },
  ニドリーノ: {
    type: ["どく"],
  },
  ニャイキング: {
    type: ["はがね"],
  },
  ニャオニクス: {
    type: ["エスパー"],
  },
  ニャオハ: {
    type: ["くさ"],
  },
  ニャスパー: {
    type: ["エスパー"],
  },
  ニャヒート: {
    type: ["ほのお"],
  },
  ニャビー: {
    type: ["ほのお"],
  },
  ニャルマー: {
    type: ["ノーマル"],
  },
  ニャローテ: {
    type: ["くさ"],
  },
  "ニャース(アローラ)": {
    type: ["あく"],
  },
  "ニャース(ガラル)": {
    type: ["はがね"],
  },
  ニャース: {
    type: ["ノーマル"],
  },
  "ニューラ(ヒスイ)": {
    type: ["かくとう", "どく"],
  },
  ニューラ: {
    type: ["あく", "こおり"],
  },
  ニョロゾ: {
    type: ["みず"],
  },
  ニョロトノ: {
    type: ["みず"],
  },
  ニョロボン: {
    type: ["みず", "かくとう"],
  },
  ニョロモ: {
    type: ["みず"],
  },
  ニンフィア: {
    type: ["フェアリー"],
  },
  ヌイコグマ: {
    type: ["ノーマル", "かくとう"],
  },
  ヌオー: {
    type: ["みず", "じめん"],
  },
  ヌケニン: {
    type: ["むし", "ゴースト"],
  },
  ヌマクロー: {
    type: ["みず", "じめん"],
  },
  "ヌメイル(ヒスイ)": {
    type: ["はがね", "ドラゴン"],
  },
  ヌメイル: {
    type: ["ドラゴン"],
  },
  ヌメラ: {
    type: ["ドラゴン"],
  },
  "ヌメルゴン(ヒスイ)": {
    type: ["はがね", "ドラゴン"],
  },
  ヌメルゴン: {
    type: ["ドラゴン"],
  },
  ネイティ: {
    type: ["エスパー", "ひこう"],
  },
  ネイティオ: {
    type: ["エスパー", "ひこう"],
  },
  ネオラント: {
    type: ["みず"],
  },
  ネギガナイト: {
    type: ["かくとう"],
  },
  "ネクロズマ(げっしょく)": {
    type: ["エスパー", "ゴースト"],
  },
  "ネクロズマ(にっしょく)": {
    type: ["エスパー", "はがね"],
  },
  ネクロズマ: {
    type: ["エスパー"],
  },
  ネッコアラ: {
    type: ["ノーマル"],
  },
  ネマシュ: {
    type: ["くさ", "フェアリー"],
  },
  ネンドール: {
    type: ["じめん", "エスパー"],
  },
  ノクタス: {
    type: ["くさ", "あく"],
  },
  ノココッチ: {
    type: ["ノーマル"],
  },
  ノコッチ: {
    type: ["ノーマル"],
  },
  ノズパス: {
    type: ["いわ"],
  },
  ノノクラゲ: {
    type: ["じめん", "くさ"],
  },
  ハカドッグ: {
    type: ["ゴースト"],
  },
  ハガネール: {
    type: ["はがね", "じめん"],
  },
  ハギギシリ: {
    type: ["みず", "エスパー"],
  },
  ハクリュー: {
    type: ["ドラゴン"],
  },
  ハスブレロ: {
    type: ["みず", "くさ"],
  },
  ハスボー: {
    type: ["みず", "くさ"],
  },
  ハッサム: {
    type: ["むし", "はがね"],
  },
  ハトーボー: {
    type: ["ノーマル", "ひこう"],
  },
  ハネッコ: {
    type: ["くさ", "ひこう"],
  },
  ハハコモリ: {
    type: ["むし", "くさ"],
  },
  ハバタクカミ: {
    type: ["ゴースト", "フェアリー"],
  },
  ハピナス: {
    type: ["ノーマル"],
  },
  ハブネーク: {
    type: ["どく"],
  },
  ハヤシガメ: {
    type: ["くさ"],
  },
  ハラバリー: {
    type: ["でんき"],
  },
  ハリテヤマ: {
    type: ["かくとう"],
  },
  ハリボーグ: {
    type: ["くさ"],
  },
  ハリマロン: {
    type: ["くさ"],
  },
  "ハリーセン(ヒスイ)": {
    type: ["あく", "どく"],
  },
  ハリーセン: {
    type: ["みず", "どく"],
  },
  ハリーマン: {
    type: ["あく", "どく"],
  },
  ハルクジラ: {
    type: ["こおり"],
  },
  ハンテール: {
    type: ["みず"],
  },
  ハーデリア: {
    type: ["ノーマル"],
  },
  バイウールー: {
    type: ["ノーマル"],
  },
  バイバニラ: {
    type: ["こおり"],
  },
  バウッツェル: {
    type: ["フェアリー"],
  },
  バオッキー: {
    type: ["ほのお"],
  },
  バオップ: {
    type: ["ほのお"],
  },
  バクオング: {
    type: ["ノーマル"],
  },
  バクガメス: {
    type: ["ほのお", "ドラゴン"],
  },
  "バクフーン(ヒスイ)": {
    type: ["ほのお", "ゴースト"],
  },
  バクフーン: {
    type: ["ほのお"],
  },
  バクーダ: {
    type: ["ほのお", "じめん"],
  },
  バケッチャ: {
    type: ["ゴースト", "くさ"],
  },
  バサギリ: {
    type: ["むし", "いわ"],
  },
  バシャーモ: {
    type: ["ほのお", "かくとう"],
  },
  バスラオ: {
    type: ["みず"],
  },
  バタフリー: {
    type: ["むし", "ひこう"],
  },
  バチュル: {
    type: ["むし", "でんき"],
  },
  バチンウニ: {
    type: ["でんき"],
  },
  バチンキー: {
    type: ["くさ"],
  },
  バッフロン: {
    type: ["ノーマル"],
  },
  "バドレックス(こくば)": {
    type: ["エスパー", "ゴースト"],
  },
  "バドレックス(はくば)": {
    type: ["エスパー", "こおり"],
  },
  バドレックス: {
    type: ["エスパー", "くさ"],
  },
  バニプッチ: {
    type: ["こおり"],
  },
  バニリッチ: {
    type: ["こおり"],
  },
  バネブー: {
    type: ["エスパー"],
  },
  バリコオル: {
    type: ["こおり", "エスパー"],
  },
  "バリヤード(ガラル)": {
    type: ["こおり", "エスパー"],
  },
  バリヤード: {
    type: ["エスパー", "フェアリー"],
  },
  バルキー: {
    type: ["かくとう"],
  },
  バルジーナ: {
    type: ["あく", "ひこう"],
  },
  バルチャイ: {
    type: ["あく", "ひこう"],
  },
  バルビート: {
    type: ["むし"],
  },
  バンギラス: {
    type: ["いわ", "あく"],
  },
  バンバドロ: {
    type: ["じめん"],
  },
  パウワウ: {
    type: ["みず"],
  },
  パオジアン: {
    type: ["あく", "こおり"],
  },
  パチリス: {
    type: ["でんき"],
  },
  パッチラゴン: {
    type: ["でんき", "ドラゴン"],
  },
  パッチルドン: {
    type: ["でんき", "こおり"],
  },
  パッチール: {
    type: ["ノーマル"],
  },
  パピモッチ: {
    type: ["フェアリー"],
  },
  パフュートン: {
    type: ["ノーマル"],
  },
  パモ: {
    type: ["でんき"],
  },
  パモット: {
    type: ["でんき", "かくとう"],
  },
  パラス: {
    type: ["むし", "くさ"],
  },
  パラセクト: {
    type: ["むし", "くさ"],
  },
  パルキア: {
    type: ["みず", "ドラゴン"],
  },
  パルシェン: {
    type: ["みず", "こおり"],
  },
  パルスワン: {
    type: ["でんき"],
  },
  パンプジン: {
    type: ["ゴースト", "くさ"],
  },
  パーモット: {
    type: ["でんき", "かくとう"],
  },
  パールル: {
    type: ["みず"],
  },
  ヒコザル: {
    type: ["ほのお"],
  },
  ヒトカゲ: {
    type: ["ほのお"],
  },
  ヒトツキ: {
    type: ["はがね", "ゴースト"],
  },
  ヒトデマン: {
    type: ["みず"],
  },
  ヒトモシ: {
    type: ["ゴースト", "ほのお"],
  },
  ヒドイデ: {
    type: ["どく", "みず"],
  },
  ヒノアラシ: {
    type: ["ほのお"],
  },
  ヒノヤコマ: {
    type: ["ほのお", "ひこう"],
  },
  ヒバニー: {
    type: ["ほのお"],
  },
  "ヒヒダルマ(ガラル)": {
    type: ["こおり"],
  },
  ヒヒダルマ: {
    type: ["ほのお"],
  },
  ヒポポタス: {
    type: ["じめん"],
  },
  ヒマナッツ: {
    type: ["くさ"],
  },
  ヒメグマ: {
    type: ["ノーマル"],
  },
  ヒメンカ: {
    type: ["くさ"],
  },
  ヒヤッキー: {
    type: ["みず"],
  },
  ヒヤップ: {
    type: ["みず"],
  },
  ヒラヒナ: {
    type: ["エスパー"],
  },
  ヒンバス: {
    type: ["みず"],
  },
  ヒードラン: {
    type: ["ほのお", "はがね"],
  },
  ビクティニ: {
    type: ["エスパー", "ほのお"],
  },
  ビッパ: {
    type: ["ノーマル"],
  },
  ビビヨン: {
    type: ["むし", "ひこう"],
  },
  ビブラーバ: {
    type: ["じめん", "ドラゴン"],
  },
  ビリジオン: {
    type: ["くさ", "かくとう"],
  },
  "ビリリダマ(ヒスイ)": {
    type: ["でんき", "くさ"],
  },
  ビリリダマ: {
    type: ["でんき"],
  },
  ビークイン: {
    type: ["むし", "ひこう"],
  },
  ビーダル: {
    type: ["ノーマル", "みず"],
  },
  ビードル: {
    type: ["むし", "どく"],
  },
  ピィ: {
    type: ["フェアリー"],
  },
  ピカチュウ: {
    type: ["でんき"],
  },
  ピクシー: {
    type: ["フェアリー"],
  },
  ピジョット: {
    type: ["ノーマル", "ひこう"],
  },
  ピジョン: {
    type: ["ノーマル", "ひこう"],
  },
  ピチュー: {
    type: ["でんき"],
  },
  ピッピ: {
    type: ["フェアリー"],
  },
  ピンプク: {
    type: ["ノーマル"],
  },
  ファイアロー: {
    type: ["ほのお", "ひこう"],
  },
  "ファイヤー(ガラル)": {
    type: ["あく", "ひこう"],
  },
  ファイヤー: {
    type: ["ほのお", "ひこう"],
  },
  フィオネ: {
    type: ["みず"],
  },
  フェローチェ: {
    type: ["むし", "かくとう"],
  },
  フォクスライ: {
    type: ["あく"],
  },
  フォッコ: {
    type: ["ほのお"],
  },
  フォレトス: {
    type: ["むし", "はがね"],
  },
  フカマル: {
    type: ["ドラゴン", "じめん"],
  },
  フクスロー: {
    type: ["くさ", "ひこう"],
  },
  フシギソウ: {
    type: ["くさ", "どく"],
  },
  フシギダネ: {
    type: ["くさ", "どく"],
  },
  フシギバナ: {
    type: ["くさ", "どく"],
  },
  フシデ: {
    type: ["むし", "どく"],
  },
  フタチマル: {
    type: ["みず"],
  },
  フライゴン: {
    type: ["じめん", "ドラゴン"],
  },
  フラエッテ: {
    type: ["フェアリー"],
  },
  フラベベ: {
    type: ["フェアリー"],
  },
  フラージェス: {
    type: ["フェアリー"],
  },
  "フリーザー(ガラル)": {
    type: ["エスパー", "ひこう"],
  },
  フリーザー: {
    type: ["こおり", "ひこう"],
  },
  フリージオ: {
    type: ["こおり"],
  },
  フレフワン: {
    type: ["フェアリー"],
  },
  フローゼル: {
    type: ["みず"],
  },
  フワライド: {
    type: ["ゴースト", "ひこう"],
  },
  フワンテ: {
    type: ["ゴースト", "ひこう"],
  },
  フーディン: {
    type: ["エスパー"],
  },
  "フーパ(ときはなたれし)": {
    type: ["エスパー", "あく"],
  },
  フーパ: {
    type: ["エスパー", "ゴースト"],
  },
  ブイゼル: {
    type: ["みず"],
  },
  ブニャット: {
    type: ["ノーマル"],
  },
  ブビィ: {
    type: ["ほのお"],
  },
  ブラッキー: {
    type: ["あく"],
  },
  ブリガロン: {
    type: ["くさ", "かくとう"],
  },
  ブリザポス: {
    type: ["こおり"],
  },
  ブリムオン: {
    type: ["エスパー", "フェアリー"],
  },
  ブルンゲル: {
    type: ["みず", "ゴースト"],
  },
  ブルー: {
    type: ["フェアリー"],
  },
  ブロスター: {
    type: ["みず"],
  },
  ブロロローム: {
    type: ["はがね", "どく"],
  },
  ブロロン: {
    type: ["はがね", "どく"],
  },
  ブースター: {
    type: ["ほのお"],
  },
  ブーバー: {
    type: ["ほのお"],
  },
  ブーバーン: {
    type: ["ほのお"],
  },
  ブーピッグ: {
    type: ["エスパー"],
  },
  プクリン: {
    type: ["ノーマル", "フェアリー"],
  },
  プテラ: {
    type: ["いわ", "ひこう"],
  },
  ププリン: {
    type: ["ノーマル", "フェアリー"],
  },
  プラスル: {
    type: ["でんき"],
  },
  プリン: {
    type: ["ノーマル", "フェアリー"],
  },
  プルリル: {
    type: ["みず", "ゴースト"],
  },
  プロトーガ: {
    type: ["みず", "いわ"],
  },
  ヘイガニ: {
    type: ["みず"],
  },
  ヘイラッシャ: {
    type: ["みず"],
  },
  ヘラクロス: {
    type: ["むし", "かくとう"],
  },
  ヘルガー: {
    type: ["あく", "ほのお"],
  },
  ベイリーフ: {
    type: ["くさ"],
  },
  "ベトベター(アローラ)": {
    type: ["どく", "あく"],
  },
  ベトベター: {
    type: ["どく"],
  },
  "ベトベトン(アローラ)": {
    type: ["どく", "あく"],
  },
  ベトベトン: {
    type: ["どく"],
  },
  ベベノム: {
    type: ["どく"],
  },
  ベラカス: {
    type: ["むし", "エスパー"],
  },
  ベロバー: {
    type: ["あく", "フェアリー"],
  },
  ベロベルト: {
    type: ["ノーマル"],
  },
  ベロリンガ: {
    type: ["ノーマル"],
  },
  ペラップ: {
    type: ["ノーマル", "ひこう"],
  },
  ペリッパー: {
    type: ["みず", "ひこう"],
  },
  "ペルシアン(アローラ)": {
    type: ["あく"],
  },
  ペルシアン: {
    type: ["ノーマル"],
  },
  ペロッパフ: {
    type: ["フェアリー"],
  },
  ペロリーム: {
    type: ["フェアリー"],
  },
  ペンドラー: {
    type: ["むし", "どく"],
  },
  ホイーガ: {
    type: ["むし", "どく"],
  },
  ホウオウ: {
    type: ["ほのお", "ひこう"],
  },
  ホエルオー: {
    type: ["みず"],
  },
  ホエルコ: {
    type: ["みず"],
  },
  ホゲータ: {
    type: ["ほのお"],
  },
  ホシガリス: {
    type: ["ノーマル"],
  },
  ホルビー: {
    type: ["ノーマル"],
  },
  ホルード: {
    type: ["ノーマル", "じめん"],
  },
  ホーホー: {
    type: ["ノーマル", "ひこう"],
  },
  ボクレー: {
    type: ["ゴースト", "くさ"],
  },
  ボスゴドラ: {
    type: ["はがね", "いわ"],
  },
  ボチ: {
    type: ["ゴースト"],
  },
  ボルケニオン: {
    type: ["ほのお", "みず"],
  },
  ボルトロス: {
    type: ["でんき", "ひこう"],
  },
  ボーマンダ: {
    type: ["ドラゴン", "ひこう"],
  },
  ポカブ: {
    type: ["ほのお"],
  },
  ポチエナ: {
    type: ["あく"],
  },
  ポッタイシ: {
    type: ["みず"],
  },
  ポッチャマ: {
    type: ["みず"],
  },
  ポットデス: {
    type: ["ゴースト"],
  },
  ポッポ: {
    type: ["ノーマル", "ひこう"],
  },
  "ポニータ(ガラル)": {
    type: ["エスパー"],
  },
  ポニータ: {
    type: ["ほのお"],
  },
  ポポッコ: {
    type: ["くさ", "ひこう"],
  },
  ポリゴンZ: {
    type: ["ノーマル"],
  },
  ポリゴン: {
    type: ["ノーマル"],
  },
  ポワルン: {
    type: ["ノーマル"],
  },
  マイナン: {
    type: ["でんき"],
  },
  マギアナ: {
    type: ["はがね", "フェアリー"],
  },
  マクノシタ: {
    type: ["かくとう"],
  },
  マグカルゴ: {
    type: ["ほのお", "いわ"],
  },
  マグマッグ: {
    type: ["ほのお"],
  },
  マグマラシ: {
    type: ["ほのお"],
  },
  マケンカニ: {
    type: ["かくとう"],
  },
  マシェード: {
    type: ["くさ", "フェアリー"],
  },
  マスカーニャ: {
    type: ["くさ", "あく"],
  },
  マスキッパ: {
    type: ["くさ"],
  },
  "マタドガス(ガラル)": {
    type: ["どく", "フェアリー"],
  },
  マタドガス: {
    type: ["どく"],
  },
  マダツボミ: {
    type: ["くさ", "どく"],
  },
  "マッギョ(ガラル)": {
    type: ["じめん", "はがね"],
  },
  マッギョ: {
    type: ["でんき", "じめん"],
  },
  マッシブーン: {
    type: ["むし", "かくとう"],
  },
  "マッスグマ(ガラル)": {
    type: ["あく", "ノーマル"],
  },
  マッスグマ: {
    type: ["ノーマル"],
  },
  マナフィ: {
    type: ["みず"],
  },
  マニューラ: {
    type: ["あく", "こおり"],
  },
  マネネ: {
    type: ["エスパー", "フェアリー"],
  },
  マフィティフ: {
    type: ["あく"],
  },
  マフォクシー: {
    type: ["ほのお", "エスパー"],
  },
  マホイップ: {
    type: ["フェアリー"],
  },
  マホミル: {
    type: ["フェアリー"],
  },
  ママンボウ: {
    type: ["みず"],
  },
  マメバッタ: {
    type: ["むし"],
  },
  マメパト: {
    type: ["ノーマル", "ひこう"],
  },
  マユルド: {
    type: ["むし"],
  },
  マラカッチ: {
    type: ["くさ"],
  },
  マリル: {
    type: ["みず", "フェアリー"],
  },
  マリルリ: {
    type: ["みず", "フェアリー"],
  },
  マルノーム: {
    type: ["どく"],
  },
  "マルマイン(ヒスイ)": {
    type: ["でんき", "くさ"],
  },
  マルマイン: {
    type: ["でんき"],
  },
  マルヤクデ: {
    type: ["ほのお", "むし"],
  },
  マンキー: {
    type: ["かくとう"],
  },
  マンタイン: {
    type: ["みず", "ひこう"],
  },
  マンムー: {
    type: ["こおり", "じめん"],
  },
  マーイーカ: {
    type: ["あく", "エスパー"],
  },
  マーシャドー: {
    type: ["かくとう", "ゴースト"],
  },
  ミカルゲ: {
    type: ["ゴースト", "あく"],
  },
  ミガルーサ: {
    type: ["みず", "エスパー"],
  },
  ミジュマル: {
    type: ["みず"],
  },
  ミズゴロウ: {
    type: ["みず"],
  },
  ミツハニー: {
    type: ["むし", "ひこう"],
  },
  ミニリュウ: {
    type: ["ドラゴン"],
  },
  ミニーブ: {
    type: ["くさ", "ノーマル"],
  },
  ミネズミ: {
    type: ["ノーマル"],
  },
  "ミノマダム(すな)": {
    type: ["むし", "じめん"],
  },
  "ミノマダム(ゴミ)": {
    type: ["むし", "はがね"],
  },
  ミノマダム: {
    type: ["むし", "くさ"],
  },
  ミノムッチ: {
    type: ["むし"],
  },
  ミブリム: {
    type: ["エスパー"],
  },
  ミミズズ: {
    type: ["はがね"],
  },
  ミミッキュ: {
    type: ["ゴースト", "フェアリー"],
  },
  ミミロップ: {
    type: ["ノーマル"],
  },
  ミミロル: {
    type: ["ノーマル"],
  },
  ミュウ: {
    type: ["エスパー"],
  },
  ミュウツー: {
    type: ["エスパー"],
  },
  ミライドン: {
    type: ["でんき", "ドラゴン"],
  },
  ミルタンク: {
    type: ["ノーマル"],
  },
  ミルホッグ: {
    type: ["ノーマル"],
  },
  ミロカロス: {
    type: ["みず"],
  },
  ムウマ: {
    type: ["ゴースト"],
  },
  ムウマージ: {
    type: ["ゴースト"],
  },
  ムクバード: {
    type: ["ノーマル", "ひこう"],
  },
  ムクホーク: {
    type: ["ノーマル", "ひこう"],
  },
  ムゲンダイナ: {
    type: ["どく", "ドラゴン"],
  },
  ムシャーナ: {
    type: ["エスパー"],
  },
  ムチュール: {
    type: ["こおり", "エスパー"],
  },
  ムックル: {
    type: ["ノーマル", "ひこう"],
  },
  ムンナ: {
    type: ["エスパー"],
  },
  ムーランド: {
    type: ["ノーマル"],
  },
  メェークル: {
    type: ["くさ"],
  },
  メガニウム: {
    type: ["くさ"],
  },
  メガヤンマ: {
    type: ["むし", "ひこう"],
  },
  メグロコ: {
    type: ["じめん", "あく"],
  },
  メタグロス: {
    type: ["はがね", "エスパー"],
  },
  メタモン: {
    type: ["ノーマル"],
  },
  メタング: {
    type: ["はがね", "エスパー"],
  },
  メッソン: {
    type: ["みず"],
  },
  メテノ: {
    type: ["いわ", "ひこう"],
  },
  メノクラゲ: {
    type: ["みず", "どく"],
  },
  メブキジカ: {
    type: ["ノーマル", "くさ"],
  },
  メラルバ: {
    type: ["むし", "ほのお"],
  },
  メリープ: {
    type: ["でんき"],
  },
  メルタン: {
    type: ["はがね"],
  },
  メルメタル: {
    type: ["はがね"],
  },
  メレシー: {
    type: ["いわ", "フェアリー"],
  },
  メロエッタ: {
    type: ["ノーマル", "エスパー"],
  },
  モウカザル: {
    type: ["ほのお", "かくとう"],
  },
  モクロー: {
    type: ["くさ", "ひこう"],
  },
  モグリュー: {
    type: ["じめん"],
  },
  モココ: {
    type: ["でんき"],
  },
  モジャンボ: {
    type: ["くさ"],
  },
  モスノウ: {
    type: ["こおり", "むし"],
  },
  モトトカゲ: {
    type: ["ドラゴン", "ノーマル"],
  },
  モノズ: {
    type: ["あく", "ドラゴン"],
  },
  モルフォン: {
    type: ["むし", "どく"],
  },
  モルペコ: {
    type: ["でんき", "あく"],
  },
  モロバレル: {
    type: ["くさ", "どく"],
  },
  モンジャラ: {
    type: ["くさ"],
  },
  モンメン: {
    type: ["くさ", "フェアリー"],
  },
  ヤクデ: {
    type: ["ほのお", "むし"],
  },
  ヤジロン: {
    type: ["じめん", "エスパー"],
  },
  ヤトウモリ: {
    type: ["どく", "ほのお"],
  },
  "ヤドキング(ガラル)": {
    type: ["どく", "エスパー"],
  },
  ヤドキング: {
    type: ["みず", "エスパー"],
  },
  "ヤドラン(ガラル)": {
    type: ["どく", "エスパー"],
  },
  ヤドラン: {
    type: ["みず", "エスパー"],
  },
  "ヤドン(ガラル)": {
    type: ["エスパー"],
  },
  ヤドン: {
    type: ["みず", "エスパー"],
  },
  ヤナッキー: {
    type: ["くさ"],
  },
  ヤナップ: {
    type: ["くさ"],
  },
  ヤバチャ: {
    type: ["ゴースト"],
  },
  ヤブクロン: {
    type: ["どく"],
  },
  ヤミカラス: {
    type: ["あく", "ひこう"],
  },
  ヤミラミ: {
    type: ["あく", "ゴースト"],
  },
  ヤヤコマ: {
    type: ["ノーマル", "ひこう"],
  },
  ヤルキモノ: {
    type: ["ノーマル"],
  },
  ヤレユータン: {
    type: ["ノーマル", "エスパー"],
  },
  ヤングース: {
    type: ["ノーマル"],
  },
  ヤンチャム: {
    type: ["かくとう"],
  },
  ヤンヤンマ: {
    type: ["むし", "ひこう"],
  },
  ユキカブリ: {
    type: ["くさ", "こおり"],
  },
  ユキノオー: {
    type: ["くさ", "こおり"],
  },
  ユキハミ: {
    type: ["こおり", "むし"],
  },
  ユキメノコ: {
    type: ["こおり", "ゴースト"],
  },
  ユキワラシ: {
    type: ["こおり"],
  },
  ユクシー: {
    type: ["エスパー"],
  },
  ユニラン: {
    type: ["エスパー"],
  },
  ユレイドル: {
    type: ["いわ", "くさ"],
  },
  ユンゲラー: {
    type: ["エスパー"],
  },
  ヨクバリス: {
    type: ["ノーマル"],
  },
  ヨノワール: {
    type: ["ゴースト"],
  },
  ヨマワル: {
    type: ["ゴースト"],
  },
  ヨルノズク: {
    type: ["ノーマル", "ひこう"],
  },
  ヨワシ: {
    type: ["みず"],
  },
  ヨーギラス: {
    type: ["いわ", "じめん"],
  },
  ヨーテリー: {
    type: ["ノーマル"],
  },
  ライコウ: {
    type: ["でんき"],
  },
  "ライチュウ(アローラ)": {
    type: ["でんき", "エスパー"],
  },
  ライチュウ: {
    type: ["でんき"],
  },
  ライボルト: {
    type: ["でんき"],
  },
  ラウドボーン: {
    type: ["ほのお", "ゴースト"],
  },
  ラクライ: {
    type: ["でんき"],
  },
  ラグラージ: {
    type: ["みず", "じめん"],
  },
  ラッキー: {
    type: ["ノーマル"],
  },
  "ラッタ(アローラ)": {
    type: ["あく", "ノーマル"],
  },
  ラッタ: {
    type: ["ノーマル"],
  },
  ラティアス: {
    type: ["ドラゴン", "エスパー"],
  },
  ラティオス: {
    type: ["ドラゴン", "エスパー"],
  },
  ラビフット: {
    type: ["ほのお"],
  },
  ラフレシア: {
    type: ["くさ", "どく"],
  },
  ラブカス: {
    type: ["みず"],
  },
  ラブトロス: {
    type: ["フェアリー", "ひこう"],
  },
  ラプラス: {
    type: ["みず", "こおり"],
  },
  ラムパルド: {
    type: ["いわ"],
  },
  ラランテス: {
    type: ["くさ"],
  },
  ラルトス: {
    type: ["エスパー", "フェアリー"],
  },
  ランクルス: {
    type: ["エスパー"],
  },
  ランターン: {
    type: ["みず", "でんき"],
  },
  ランドロス: {
    type: ["じめん", "ひこう"],
  },
  ランプラー: {
    type: ["ゴースト", "ほのお"],
  },
  リオル: {
    type: ["かくとう"],
  },
  リキキリン: {
    type: ["ノーマル", "エスパー"],
  },
  リククラゲ: {
    type: ["じめん", "くさ"],
  },
  リグレー: {
    type: ["エスパー"],
  },
  リザード: {
    type: ["ほのお"],
  },
  リザードン: {
    type: ["ほのお", "ひこう"],
  },
  リリーラ: {
    type: ["いわ", "くさ"],
  },
  リングマ: {
    type: ["ノーマル"],
  },
  リーシャン: {
    type: ["エスパー"],
  },
  リーフィア: {
    type: ["くさ"],
  },
  ルカリオ: {
    type: ["かくとう", "はがね"],
  },
  ルガルガン: {
    type: ["いわ"],
  },
  ルギア: {
    type: ["エスパー", "ひこう"],
  },
  ルクシオ: {
    type: ["でんき"],
  },
  ルチャブル: {
    type: ["かくとう", "ひこう"],
  },
  ルナアーラ: {
    type: ["エスパー", "ゴースト"],
  },
  ルナトーン: {
    type: ["いわ", "エスパー"],
  },
  ルリリ: {
    type: ["ノーマル", "フェアリー"],
  },
  ルンパッパ: {
    type: ["みず", "くさ"],
  },
  ルージュラ: {
    type: ["こおり", "エスパー"],
  },
  レアコイル: {
    type: ["でんき", "はがね"],
  },
  レイスポス: {
    type: ["ゴースト"],
  },
  レシラム: {
    type: ["ドラゴン", "ほのお"],
  },
  レジアイス: {
    type: ["こおり"],
  },
  レジエレキ: {
    type: ["でんき"],
  },
  レジギガス: {
    type: ["ノーマル"],
  },
  レジスチル: {
    type: ["はがね"],
  },
  レジドラゴ: {
    type: ["ドラゴン"],
  },
  レジロック: {
    type: ["いわ"],
  },
  レックウザ: {
    type: ["ドラゴン", "ひこう"],
  },
  レディアン: {
    type: ["むし", "ひこう"],
  },
  レディバ: {
    type: ["むし", "ひこう"],
  },
  レドームシ: {
    type: ["むし", "エスパー"],
  },
  レパルダス: {
    type: ["あく"],
  },
  レントラー: {
    type: ["でんき"],
  },
  "ロコン(アローラ)": {
    type: ["こおり"],
  },
  ロコン: {
    type: ["ほのお"],
  },
  ロズレイド: {
    type: ["くさ", "どく"],
  },
  ロゼリア: {
    type: ["くさ", "どく"],
  },
  "ロトム(ウォッシュ)": {
    type: ["でんき", "みず"],
  },
  "ロトム(カット)": {
    type: ["でんき", "くさ"],
  },
  "ロトム(スピン)": {
    type: ["でんき", "ひこう"],
  },
  "ロトム(ヒート)": {
    type: ["でんき", "ほのお"],
  },
  "ロトム(フロスト)": {
    type: ["でんき", "こおり"],
  },
  ロトム: {
    type: ["でんき", "ゴースト"],
  },
  ローブシン: {
    type: ["かくとう"],
  },
  ワカシャモ: {
    type: ["ほのお", "かくとう"],
  },
  ワシボン: {
    type: ["ノーマル", "ひこう"],
  },
  ワタシラガ: {
    type: ["くさ"],
  },
  ワタッコ: {
    type: ["くさ", "ひこう"],
  },
  ワッカネズミ: {
    type: ["ノーマル"],
  },
  ワナイダー: {
    type: ["むし"],
  },
  ワニノコ: {
    type: ["みず"],
  },
  ワルビアル: {
    type: ["じめん", "あく"],
  },
  ワルビル: {
    type: ["じめん", "あく"],
  },
  ワンパチ: {
    type: ["でんき"],
  },
  ワンリキー: {
    type: ["かくとう"],
  },
};
